<?php
//$_SESSION = array(); // - ще варто придумати як онуляти сесію, щоб не висіли значення після реєєстрації і доробити помилки обробку
include_once ('../config/connectionToDB.php');
include_once ('../home.php');



// 1. Обробка на PHP
// Реєстрація: збереження email/пароля (на перших порах у файл, потім — БД)

// Авторизація: перевірка введених даних

// 🔹 2. Валідація даних (на стороні PHP)
// Чи заповнені поля

// Чи коректний email

// Чи співпадають паролі

// 🔹 3. Захист
// Хешування паролів (через password_hash())

// Уникнення повторної реєстрації з тим самим email